tap "cormacrelf/tap"
tap "dteoh/devdocs"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "jesseduffield/lazydocker"
tap "koekeishiya/formulae"
tap "mgmeyers/pdfannots2json"
tap "saulpw/vd"
tap "wez/wezterm"
tap "yigitozgumus/formulae"
brew "ack"
brew "aria2"
brew "astro"
brew "boost"
brew "bpytop"
brew "glib"
brew "cmake"
brew "docker"
brew "docker-compose"
brew "duf"
brew "folly"
brew "edencommon"
brew "harfbuzz"
brew "node"
brew "openjdk"
brew "emscripten"
brew "eslint"
brew "exa"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "gitui"
brew "unbound"
brew "gnutls"
brew "libusb"
brew "gnupg"
brew "goreleaser"
brew "helix"
brew "htop"
brew "hugo"
brew "kotlin"
brew "lazydocker"
brew "lazygit"
brew "webp"
brew "lf"
brew "libxkbcommon"
brew "lua"
brew "lua-language-server"
brew "luajit"
brew "mongocli"
brew "pandoc"
brew "ripgrep"
brew "nb"
brew "ncdu"
brew "neofetch"
brew "tree-sitter", args: ["HEAD"]
brew "neovim"
brew "nyancat"
brew "openjdk@11", link: true
brew "prettier"
brew "pyenv"
brew "python@3.10"
brew "python@3.9"
brew "qt@5"
brew "ranger"
brew "redis"
brew "ruby"
brew "smimesign"
brew "spaceship"
brew "task"
brew "taskwarrior-tui"
brew "thefuck"
brew "timewarrior"
brew "tmux"
brew "tmuxp"
brew "tree"
brew "vifm"
brew "vim"
brew "vit"
brew "vite"
brew "watchman"
brew "wget"
brew "xdotool"
brew "yarn"
brew "zsh"
brew "cormacrelf/tap/dark-notify"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai", args: ["HEAD"]
brew "mgmeyers/pdfannots2json/pdfannots2json"
brew "yigitozgumus/formulae/lazydraft"
cask "alacritty"
cask "alt-tab"
cask "amethyst"
cask "android-platform-tools"
cask "appcleaner"
cask "calibre"
cask "dozer"
cask "font-hack-nerd-font"
cask "font-iosevka"
cask "font-iosevka-nerd-font"
cask "iterm2"
cask "keycastr"
cask "kitty"
cask "logseq"
cask "monitorcontrol"
cask "neovide"
cask "responsively"
cask "sublime-text"
cask "telegram"
cask "vlc"
cask "wezterm"
cask "zeplin"
